In [14]:
import numpy as np
import pandas as pd

EKSİK VERİLERLE ÇALIŞMAK

np.nan EKSİK veri yerine yaz

In [15]:
sozluk_veri={"istanbul":[30,29,np.nan],"ankara":[36,np.nan,34],"izmir":[30,32,31]}

In [16]:
hava_durumu_df=pd.DataFrame(sozluk_veri)

In [17]:
hava_durumu_df

   istanbul  ankara  izmir
0      30.0    36.0     30
1      29.0     NaN     32
2       NaN    34.0     31

In [18]:
hava_durumu_df.dropna()

   istanbul  ankara  izmir
0      30.0    36.0     30

In [19]:
hava_durumu_df

   istanbul  ankara  izmir
0      30.0    36.0     30
1      29.0     NaN     32
2       NaN    34.0     31

In [20]:
hava_durumu_df.dropna(axis=0)

   istanbul  ankara  izmir
0      30.0    36.0     30

In [21]:
hava_durumu_df.dropna(axis=1)

   izmir
0     30
1     32
2     31

NaN sayısına göre kolon atma

YENİ VERİLER ÜZERİNDE ÇALIŞIYORUZ

In [45]:
sozluk_veri2={"istanbul":[30,29,np.nan,32],"ankara":[36,np.nan,34,35],"izmir":[30,32,31,33],"malatya":[40,44,np.nan,np.nan]}

In [46]:
hava_durumu_df2=pd.DataFrame(sozluk_veri2)

In [47]:
hava_durumu_df2

   istanbul  ankara  izmir  malatya
0      30.0    36.0     30     40.0
1      29.0     NaN     32     44.0
2       NaN    34.0     31      NaN
3      32.0    35.0     33      NaN

thresh NaN sayısına göre sütun/satır ları at

NaN +1 olarak yaz

In [57]:
hava_durumu_df2.dropna(axis=1,thresh=3)

   istanbul  ankara  izmir
0      30.0    36.0     30
1      29.0     NaN     32
2       NaN    34.0     31
3      32.0    35.0     33

fillna(deger) NaN olan yerleri girdiğimiz değerle doldurur

In [59]:
hava_durumu_df2.fillna(-1)

   istanbul  ankara  izmir  malatya
0      30.0    36.0     30     40.0
1      29.0    -1.0     32     44.0
2      -1.0    34.0     31     -1.0
3      32.0    35.0     33     -1.0

# 6.9 GRUPLANDIRMAK

GROUPBY

In [85]:
maas_dict={"Departman":["software","software","law","law","marketing","marketing"],
          "employees":["ahmet","necmi","kayzer","skilachi","ali","bugra"],
           "salary":[100,200,300,400,500,600]
          }

In [86]:
maas_df=pd.DataFrame(maas_dict)

In [87]:
maas_df

   Departman employees  salary
0   software     ahmet     100
1   software     necmi     200
2        law    kayzer     300
3        law  skilachi     400
4  marketing       ali     500
5  marketing     bugra     600

In [79]:
maas_df.groupby("Departman")

In [83]:
maas_df_group=maas_df.groupby("Departman")
maas_df_group.count() # TEKİL NE KADAR VAR SAYAR

           employees  salary
Departman
law                2       2
marketing          2       2
software           2       2

MAAŞ ORTALAMA HESAPLAR

In [81]:
maas_df_group.mean()

           salary
Departman
law           350
marketing     550
software      150

In [84]:
maas_df_group.first()

          employees  salary
Departman
law          kayzer     300
marketing       ali     500
software      ahmet     100

In [90]:
maas_df_group.median()

           salary
Departman
law           350
marketing     550
software      150

In [91]:
maas_df_group.min()

          employees  salary
Departman
law          kayzer     300
marketing       ali     500
software      ahmet     100

describe() DATAFRAME İ AÇIKLAR AYRINTILI

In [92]:
maas_df_group.describe()

          salary
           count   mean        std    min    25%    50%    75%    max
Departman
law          2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
marketing    2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
software     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0